{
    "version": "0.0.1a",
    "decrition": "WAW site configuration",
    
    "topics": [
        { "id": "waw",
        "name" : "WAW",
        "description" : "What about World",
        "summary" : [ "In a world full of new communications facilities every bit transmitted have more probability to be accessed or modified by a third person or machine. <br />",
            "The objective of WAW is set a couple of information units to prevent undesired data access. This information units may be documents or papers for read and also open source code for provide library, API & interface facilities. <br />",
            "All the information units of WAW project are free under GNU license." ],
        "url_main" : "https://wabout-health.blogspot.com/p/blog-page_9.html",
        "url_blog" : "https://waboutworld.blogspot.com",
        "url_feed" : null,        
        "subtopics": [
            
            { "id": "health",
                "name" : "Health",
                "description" : "Health, the most important...",
                "iconImage" : "Caduceus.png",
                "summary" : ["Health is the first of the primary objectives or main themes... <br/>",
                    "The health theme is basic in the human knowledge. All medical discovers should be free for all humans. <br/>",
                    "Is the first step in the main themes list because of fundamental logical conditions. Since the problems that WAW will solve are all related to humans, then the first objective will be provide long and healthy lives to humans.</br>" ],
                "url_main" : "https://wabout-health.blogspot.com/p/blog-page_9.html",
                "url_blog" : "https://wabout-health.blogspot.com",
                "url_feed" : "https://wabout-health.blogspot.com/feeds/posts/default",
                "subtopics" : [
                
                    { "id": "health_Physical_Layer",
                        "name" : "Physical layer",
                        "description" : "Is the health layer that is more visible.",
                        "iconImage" : "heart27.png",
                        "summary" : "The physical layer is the fisrt level in Health.",
                        "url_main" : "https://wabout-health.blogspot.com/p/what-about-health-phisical.html"
                    },
                    
                    { "id": "health_Psychological_Layer",
                        "name" : "Physical layer",
                        "description" : "Is the health layer that is more visible.",
                        "iconImage" : "heart27.png",
                        "summary" : "The physical layer is the fisrt level in Health.",
                        "url_main" : "https://wabout-health.blogspot.com/p/what-about-health-phisical.html"
                    }]      
            },
            
            
            
            {"id": "justice",
                "name" : "Justice",
                "description" : "To provide healthy communities",
                "iconImage" : "Scales_of_justice.png",
                "summary" : [ "The second main theme of WAW is Justice. Is the most abstract theme of all because of the Justice idea only affects to humans and it is because is only a human problem. <br/>", 
                    "There exist a lot of documentation about this knowledge but the concept of Justice differs in every culture. Also the nations establish different rights and laws to manage this problem. Some communities believe in Justice derived from and held by the God. <br/>",
                    "Too much points of views for the same problem. The WAW perspective for the Justice theme is based on a simple scientific method. Since the freedom of a human is basic for mental health and the Quality of life is the general well-being of individuals and societies then... the Justice is defined by the procedures that each human may refer in order to maintain the security of the community and preserve the Quality of life." ],
                "url_main" : "https://wabout-justice.blogspot.com/p/what-about-justice.html",
                "url_blog" : "https://wabout-justice.blogspot.com",
                "url_feed" : "https://wabout-justice.blogspot.com/feeds/posts/default",
                
                "subtopics" : [
                    { "id": "justice_HumanRights",
                        "name" : "Social Groups",
                        "description" : "Human Rights... a good start for Justice.",
                        "iconImage" : "tall12.png",
                        "summary" : "The humanity has achieved an important step in order to maintain the world in peace. The core rules that secure human rights has been write… now is time to follow this simple rules.",
                        "url_main" : "https://wabout-justice.blogspot.com/p/what-about-human-rights.html"
                    },
                    { "id": "justice_SocialGroups",
                        "name" : "Social Groups",
                        "description" : "Everybody need good friends...",
                        "iconImage" : "group58.png",
                        "summary" : "The interaction of humans groups or humans between humans has been a basic help for the evolution of human specie.",
                        "url_main" : "https://wabout-justice.blogspot.com/p/what-about-social-groups.html"
                    },
                    { "id": "justice_Family",
                        "name" : "Family",
                        "description" : "Necessary for maintain the specie...",
                        "iconImage" : "family4.png",
                        "summary" : ["Human evolution has a long history but humans don’t live many years. Reproduction is basic for the specie. So babies and children have to be protected and educated. <br/>",
                            "Historically humans have been grouped into family units for facilitate this basic property of evolution."],
                        "url_main" : "https://wabout-justice.blogspot.com/p/what-about-family.html"
                    },
                    { "id": "justice_Community",
                        "name" : "Community",
                        "description" : "Resolve problems in group for our interests. ",
                        "iconImage" : "people5.png",
                        "summary": ["The influence of the communities in Human evolution is derived from the necessity of territory control, knowledge and improve of the quality of live. <br />",
                            "Other of the concepts linked with community are the Social capital and socialization processes. A community is the next step in “social groups” behaviour. <br />"],
                        "url_main" : "https://wabout-justice.blogspot.com/p/what-about-community.html"
                    },
                    { "id": "justice_Law",
                        "name" : "Law",
                        "description" : "Easy intructions to preserve order and protect the specie.",
                        "iconImage" : "law.png",
                        "summary" : ["Human intelligence has and huge spectre of topics and behaviours, each animal has a point of view (interests), an environment (influences) and an adaptation (evolution). <br />",
                            "The necessity of community and family protection and the increment of the quality of life leads to a establish a well defined a common system of rules that “organize” the relations between people. "],
                        "url_main" : "https://wabout-justice.blogspot.com/p/what-about-law.html"
                    }
                
                ]
            },
            
            
            {"id": "planet"},
            {"id": "information"},
            {"id": "energy"}
        
        ]}
    ]
    
    
    

}